# ETL: BUSINESS INTELLIGENCE

In [1]:
import pandas as pd
import numpy as np
import sqlalchemy
import psycopg2

# 1. Carga de Datos

In [2]:
nm      = pd.read_csv("Datasets/name_basics.tsv", sep='\t')         # name_basics
tt      = pd.read_csv("Datasets/title_basics.tsv", sep='\t')        # title_basics
rating  = pd.read_csv("Datasets/title_ratings.tsv", sep='\t')       # title_ratings
tp      = pd.read_csv("Datasets/title_principals.tsv", sep='\t')    # title_principals
rev     = pd.read_csv("Datasets/revenue.csv")
award   = pd.read_csv("Datasets/awards.csv")

C:\Users\alama\AppData\Local\Temp\ipykernel_7788\489364894.py:2: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  tt      = pd.read_csv("Datasets/title_basics.tsv", sep='\t')        # title_basics

# 2. Limpieza de Datos

### 2.1. Estandarizacion

In [3]:
nm.replace({"\\N": None, "NaN": None}, inplace=True)
tt.replace({"\\N": None, "NaN": None}, inplace=True)
rating.replace({"\\N": None, "NaN": None}, inplace=True)
tp.replace({"\\N": None, "NaN": None}, inplace=True)
award.replace({"\\N": None, "NaN": None}, inplace=True)
rev.replace({-1: None}, inplace=True)

### 2.2. Eliminacion de Datos

In [4]:
# name titles
nm = nm[nm["primaryName"].notnull() & nm["birthYear"].notnull() & nm["deathYear"].isnull()]
nm

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
2,nm0000003,Brigitte Bardot,1934,None,"actress,soundtrack,music_department","tt0049189,tt0054452,tt0057345,tt0056404"
46,nm0000047,Sophia Loren,1934,None,"actress,soundtrack","tt0054749,tt0076085,tt0060121,tt0058335"
83,nm0000084,Gong Li,1965,None,"actress,producer","tt0430357,tt0397535,tt0473444,tt0101640"
84,nm0000085,Henner Hofmann,1950,None,"cinematographer,producer,camera_department","tt0097523,tt0113482,tt1825758,tt0097738"
86,nm0000087,Elena Koreneva,1953,None,"actress,casting_director,soundtrack","tt0123138,tt5847740,tt7529350,tt0122969"
...,...,...,...,...,...,...
12417743,nm9993199,Denis Nurulin,1997,None,actor,"tt25314032,tt8721954,tt12351166,tt16689786"
12417908,nm9993379,Fanny Hozleiter,1988,None,"director,actress,writer",tt8743182
12418036,nm9993526,Ben Ray Lujan,1972,None,NaN,"tt15385660,tt0476038,tt7516996,tt4209386"
12418044,nm9993535,Henry Lawfull,2006,None,actor,"tt5900600,tt10187208"
12418182,nm9993693,Apsara Rani,1996,None,actress,"tt8737752,tt12856788,tt13847502,tt8302382"

In [5]:
tt = tt[tt["titleType"].isin(["movie", "tvMiniSeries", "tvMovie", "tvSeries"])]
tt.loc[tt['titleType'].isin(['movie', 'tvMovie']), 'endYear'] = tt.loc[tt['titleType'].isin(['movie', 'tvMovie']), 'startYear']
tt = pd.merge(tt, rating, on="tconst", how="left")
tt = pd.merge(tt, rev, on="tconst", how="left")
tt

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,averageRating,numVotes,budget,domestic,international,worldwide
0,tt0000009,movie,Miss Jerry,Miss Jerry,0,1894,1894,45,Romance,5.3,204.0,None,None,None,None
1,tt0000147,movie,The Corbett-Fitzsimmons Fight,The Corbett-Fitzsimmons Fight,0,1897,1897,100,"Documentary,News,Sport",5.3,468.0,None,0,0,65401
2,tt0000502,movie,Bohemios,Bohemios,0,1905,1905,100,None,4.1,15.0,None,None,None,None
3,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,1906,70,"Action,Adventure,Biography",6.0,822.0,None,None,None,None
4,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907,1907,90,Drama,4.4,20.0,None,None,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1070471,tt9916680,movie,De la ilusiÃ³n al desconcierto: cine colombiano...,De la ilusiÃ³n al desconcierto: cine colombiano...,0,2007,2007,100,Documentary,NaN,NaN,None,None,None,None
1070472,tt9916692,tvMovie,Teatroteka: Czlowiek bez twarzy,Teatroteka: Czlowiek bez twarzy,0,2015,2015,66,Drama,NaN,NaN,None,None,None,None
1070473,tt9916706,movie,Dankyavar Danka,Dankyavar Danka,0,2013,2013,None,Comedy,NaN,NaN,None,None,None,None
1070474,tt9916730,movie,6 Gunn,6 Gunn,0,2017,2017,116,None,8.3,10.0,None,None,None,None
1070475,tt9916754,movie,Chico Albuquerque - RevelaÃ§Ãµes,Chico Albuquerque - RevelaÃ§Ãµes,0,2013,2013,49,Documentary,NaN,NaN,None,None,None,None

In [6]:
professions = nm[["nconst", "primaryProfession"]]
professions = professions.dropna(subset="primaryProfession")
professions = professions.assign(primaryProfession=professions["primaryProfession"].str.split(',')).explode("primaryProfession")
nm = nm.drop(columns=["primaryProfession", "knownForTitles"])
professions

             nconst primaryProfession
2         nm0000003           actress
2         nm0000003        soundtrack
2         nm0000003  music_department
46        nm0000047           actress
46        nm0000047        soundtrack
...             ...               ...
12417908  nm9993379          director
12417908  nm9993379           actress
12417908  nm9993379            writer
12418044  nm9993535             actor
12418182  nm9993693           actress

[612390 rows x 2 columns]

In [7]:
genres = tt[["tconst", "genres"]]
genres = genres.dropna(subset="genres")
genres = genres.assign(genres=genres["genres"].str.split(',')).explode("genres")
tt = tt.drop(columns=["genres", "isAdult"])
genres

            tconst       genres
0        tt0000009      Romance
1        tt0000147  Documentary
1        tt0000147         News
1        tt0000147        Sport
3        tt0000574       Action
...            ...          ...
1070470  tt9916678       Comedy
1070471  tt9916680  Documentary
1070472  tt9916692        Drama
1070473  tt9916706       Comedy
1070475  tt9916754  Documentary

[1410552 rows x 2 columns]

In [8]:
tp = tp.drop(columns=["job", "characters"])
tp = pd.merge(tp, tt["tconst"], on="tconst")
tp = pd.merge(tp, nm["nconst"], on="nconst")
tp

            tconst  ordering      nconst         category
0        tt0000574         1   nm0846887          actress
1        tt0000574         7   nm0425854         producer
2        tt0001602         7   nm0037414  cinematographer
3        tt0001965         2   nm0037414  cinematographer
4        tt0009230         6   nm0037414  cinematographer
...            ...       ...         ...              ...
1845614  tt9911946         6   nm7859692             self
1845615  tt9912232         8   nm7915481             self
1845616  tt9913702         5  nm10536824         director
1845617  tt9914822         6   nm4362945          actress
1845618  tt9916692         2   nm1697691          actress

[1845619 rows x 4 columns]

In [9]:
#row_nan = pd.DataFrame({'nconst': [np.nan]})
#nm_with_nans = pd.concat([nm["nconst"], row_nan["nconst"]], ignore_index=True)
award = pd.merge(award, tt["tconst"], on="tconst")
#award = pd.merge(award, nm_with_nans, on="nconst")
award

,award_name,year_ceremony,category,is_winner,tconst,nconst
0,Oscar,1929,Best Actor in a Leading Role,True,tt0019071,nm0417837
1,Oscar,1929,"Best Writing, Original Story",False,tt0019071,NaN
2,Oscar,1929,"Best Writing, Original Story",False,tt0019071,nm0083742
3,Oscar,1929,Best Actor in a Leading Role,False,tt0018253,nm0001932
4,Oscar,1929,Best Actor in a Leading Role,False,tt0019217,nm0001932
...,...,...,...,...,...,...
98040,Primetime Emmy,2022,Outstanding Writing for a Nonfiction Program,False,tt10801534,NaN
98041,Primetime Emmy,2022,Outstanding Writing for a Nonfiction Program,False,tt10801534,nm3282668
98042,Primetime Emmy,2022,Outstanding Writing for a Nonfiction Program,False,tt10801534,nm0464523
98043,Primetime Emmy,2022,Outstanding Writing for a Nonfiction Program,False,tt10801534,nm0650036
98044,Primetime Emmy,2022,Outstanding Writing for a Nonfiction Program,False,tt10801534,nm5423804

In [10]:
engine = sqlalchemy.create_engine('postgresql://postgres:alamastruka1023@localhost:5432/postgres')

In [11]:
nm.to_sql('name_basics',engine,index = False,if_exists='replace')

368

In [12]:
tt.to_sql('title_basics',engine,index = False,if_exists='replace')

476

In [12]:
professions.to_sql('professions',engine,index = False,if_exists='replace')

390

In [14]:
genres.to_sql('genres',engine,index = False,if_exists='replace')

552

In [13]:
tp.to_sql('title_principals',engine,index = False,if_exists='replace')

619

In [14]:
award.to_sql('awards',engine,index = False,if_exists='replace')

45